import '../models/algo.dart';

const List<Algo> alogs = [
  Algo(
      id: 0,
      title: '1. Пузырьковая сортировка',
      subTitle: 'Пузырьковая сортировка. 1',
      description: 'Пузырьковая сортировка — это простой алгоритм сортировки, который многократно проходит по списку, сравнивает соседние элементы и меняет их местами, если они находятся в неправильном порядке. Проходы по списку повторяются до тех пор, пока список не будет отсортирован.',
      imgPath: 'assets/imgs/1.jpg'
  ),
  Algo(
      id: 1,
      title: '2. Сортировка вставками',
      subTitle: 'Сортировка вставками. 2',
      description: 'Сортировка вставками — это алгоритм сортировки, который постепенно формирует отсортированный массив, вставляя каждый новый элемент на правильную позицию.',
      imgPath: 'assets/imgs/2.jpg'
  ),
  Algo(
      id: 2,
      title: '3. Quick sort',
      subTitle: 'Quick sort. 3',
      description: 'Quick sort — это эффективный алгоритм сортировки, который использует стратегию «разделяй и властвуй». Он выбирает определенный элемент (опорный) и разделяет массив на две части: элементы меньше опорного и элементы больше опорного.',
      imgPath: 'assets/imgs/3.jpg'
  )
];